SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_usart.h
/**************************************************************************//**
 * @file
 * @brief EFM32PG28 USART register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 * 
 * The licensor of this software is Silicon Laboratories Inc.
 * 
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 * 
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 * 
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFM32PG28_USART_H
#define EFM32PG28_USART_H

#define USART_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFM32PG28_USART USART
 * @{
 * @brief EFM32PG28 USART Register Declaration.
 *****************************************************************************/

/** USART Register Declaration. */
typedef struct
{
  __IM  uint32_t             IPVERSION;              /**< IPVERSION                                          */
  __IOM uint32_t             EN;                     /**< USART Enable                                       */
  __IOM uint32_t             CTRL;                   /**< Control Register                                   */
  __IOM uint32_t             FRAME;                  /**< USART Frame Format Register                        */
  __IOM uint32_t             TRIGCTRL;               /**< USART Trigger Control register                     */
  __IOM uint32_t             CMD;                    /**< Command Register                                   */
  __IM  uint32_t             STATUS;                 /**< USART Status Register                              */
  __IOM uint32_t             CLKDIV;                 /**< Clock Control Register                             */
  __IM  uint32_t             RXDATAX;                /**< RX Buffer Data Extended Register                   */
  __IM  uint32_t             RXDATA;                 /**< RX Buffer Data Register                            */
  __IM  uint32_t             RXDOUBLEX;              /**< RX Buffer Double Data Extended Register            */
  __IM  uint32_t             RXDOUBLE;               /**< RX FIFO Double Data Register                       */
  __IM  uint32_t             RXDATAXP;               /**< RX Buffer Data Extended Peek Register              */
  __IM  uint32_t             RXDOUBLEXP;             /**< RX Buffer Double Data Extended Peek R...           */
  __IOM uint32_t             TXDATAX;                /**< TX Buffer Data Extended Register                   */
  __IOM uint32_t             TXDATA;                 /**< TX Buffer Data Register                            */
  __IOM uint32_t             TXDOUBLEX;              /**< TX Buffer Double Data Extended Register            */
  __IOM uint32_t             TXDOUBLE;               /**< TX Buffer Double Data Register                     */
  __IOM uint32_t             IF;                     /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN;                    /**< Interrupt Enable Register                          */
  __IOM uint32_t             IRCTRL;                 /**< IrDA Control Register                              */
  __IOM uint32_t             I2SCTRL;                /**< I2S Control Register                               */
  __IOM uint32_t             TIMING;                 /**< Timing Register                                    */
  __IOM uint32_t             CTRLX;                  /**< Control Register Extended                          */
  __IOM uint32_t             TIMECMP0;               /**< Timer Compare 0                                    */
  __IOM uint32_t             TIMECMP1;               /**< Timer Compare 1                                    */
  __IOM uint32_t             TIMECMP2;               /**< Timer Compare 2                                    */
        uint32_t             RESERVED0[997U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_SET;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_SET;                 /**< USART Enable                                       */
  __IOM uint32_t             CTRL_SET;               /**< Control Register                                   */
  __IOM uint32_t             FRAME_SET;              /**< USART Frame Format Register                        */
  __IOM uint32_t             TRIGCTRL_SET;           /**< USART Trigger Control register                     */
  __IOM uint32_t             CMD_SET;                /**< Command Register                                   */
  __IM  uint32_t             STATUS_SET;             /**< USART Status Register                              */
  __IOM uint32_t             CLKDIV_SET;             /**< Clock Control Register                             */
  __IM  uint32_t             RXDATAX_SET;            /**< RX Buffer Data Extended Register                   */
  __IM  uint32_t             RXDATA_SET;             /**< RX Buffer Data Register                            */
  __IM  uint32_t             RXDOUBLEX_SET;          /**< RX Buffer Double Data Extended Register            */
  __IM  uint32_t             RXDOUBLE_SET;           /**< RX FIFO Double Data Register                       */
  __IM  uint32_t             RXDATAXP_SET;           /**< RX Buffer Data Extended Peek Register              */
  __IM  uint32_t             RXDOUBLEXP_SET;         /**< RX Buffer Double Data Extended Peek R...           */
  __IOM uint32_t             TXDATAX_SET;            /**< TX Buffer Data Extended Register                   */
  __IOM uint32_t             TXDATA_SET;             /**< TX Buffer Data Register                            */
  __IOM uint32_t             TXDOUBLEX_SET;          /**< TX Buffer Double Data Extended Register            */
  __IOM uint32_t             TXDOUBLE_SET;           /**< TX Buffer Double Data Register                     */
  __IOM uint32_t             IF_SET;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_SET;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             IRCTRL_SET;             /**< IrDA Control Register                              */
  __IOM uint32_t             I2SCTRL_SET;            /**< I2S Control Register                               */
  __IOM uint32_t             TIMING_SET;             /**< Timing Register                                    */
  __IOM uint32_t             CTRLX_SET;              /**< Control Register Extended                          */
  __IOM uint32_t             TIMECMP0_SET;           /**< Timer Compare 0                                    */
  __IOM uint32_t             TIMECMP1_SET;           /**< Timer Compare 1                                    */
  __IOM uint32_t             TIMECMP2_SET;           /**< Timer Compare 2                                    */
        uint32_t             RESERVED1[997U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_CLR;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_CLR;                 /**< USART Enable                                       */
  __IOM uint32_t             CTRL_CLR;               /**< Control Register                                   */
  __IOM uint32_t             FRAME_CLR;              /**< USART Frame Format Register                        */
  __IOM uint32_t             TRIGCTRL_CLR;           /**< USART Trigger Control register                     */
  __IOM uint32_t             CMD_CLR;                /**< Command Register                                   */
  __IM  uint32_t             STATUS_CLR;             /**< USART Status Register                              */
  __IOM uint32_t             CLKDIV_CLR;             /**< Clock Control Register                             */
  __IM  uint32_t             RXDATAX_CLR;            /**< RX Buffer Data Extended Register                   */
  __IM  uint32_t             RXDATA_CLR;             /**< RX Buffer Data Register                            */
  __IM  uint32_t             RXDOUBLEX_CLR;          /**< RX Buffer Double Data Extended Register            */
  __IM  uint32_t             RXDOUBLE_CLR;           /**< RX FIFO Double Data Register                       */
  __IM  uint32_t             RXDATAXP_CLR;           /**< RX Buffer Data Extended Peek Register              */
  __IM  uint32_t             RXDOUBLEXP_CLR;         /**< RX Buffer Double Data Extended Peek R...           */
  __IOM uint32_t             TXDATAX_CLR;            /**< TX Buffer Data Extended Register                   */
  __IOM uint32_t             TXDATA_CLR;             /**< TX Buffer Data Register                            */
  __IOM uint32_t             TXDOUBLEX_CLR;          /**< TX Buffer Double Data Extended Register            */
  __IOM uint32_t             TXDOUBLE_CLR;           /**< TX Buffer Double Data Register                     */
  __IOM uint32_t             IF_CLR;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_CLR;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             IRCTRL_CLR;             /**< IrDA Control Register                              */
  __IOM uint32_t             I2SCTRL_CLR;            /**< I2S Control Register                               */
  __IOM uint32_t             TIMING_CLR;             /**< Timing Register                                    */
  __IOM uint32_t             CTRLX_CLR;              /**< Control Register Extended                          */
  __IOM uint32_t             TIMECMP0_CLR;           /**< Timer Compare 0                                    */
  __IOM uint32_t             TIMECMP1_CLR;           /**< Timer Compare 1                                    */
  __IOM uint32_t             TIMECMP2_CLR;           /**< Timer Compare 2                                    */
        uint32_t             RESERVED2[997U];   /**< Reserved for future use                            */
  __IM  uint32_t             IPVERSION_TGL;          /**< IPVERSION                                          */
  __IOM uint32_t             EN_TGL;                 /**< USART Enable                                       */
  __IOM uint32_t             CTRL_TGL;               /**< Control Register                                   */
  __IOM uint32_t             FRAME_TGL;              /**< USART Frame Format Register                        */
  __IOM uint32_t             TRIGCTRL_TGL;           /**< USART Trigger Control register                     */
  __IOM uint32_t             CMD_TGL;                /**< Command Register                                   */
  __IM  uint32_t             STATUS_TGL;             /**< USART Status Register                              */
  __IOM uint32_t             CLKDIV_TGL;             /**< Clock Control Register                             */
  __IM  uint32_t             RXDATAX_TGL;            /**< RX Buffer Data Extended Register                   */
  __IM  uint32_t             RXDATA_TGL;             /**< RX Buffer Data Register                            */
  __IM  uint32_t             RXDOUBLEX_TGL;          /**< RX Buffer Double Data Extended Register            */
  __IM  uint32_t             RXDOUBLE_TGL;           /**< RX FIFO Double Data Register                       */
  __IM  uint32_t             RXDATAXP_TGL;           /**< RX Buffer Data Extended Peek Register              */
  __IM  uint32_t             RXDOUBLEXP_TGL;         /**< RX Buffer Double Data Extended Peek R...           */
  __IOM uint32_t             TXDATAX_TGL;            /**< TX Buffer Data Extended Register                   */
  __IOM uint32_t             TXDATA_TGL;             /**< TX Buffer Data Register                            */
  __IOM uint32_t             TXDOUBLEX_TGL;          /**< TX Buffer Double Data Extended Register            */
  __IOM uint32_t             TXDOUBLE_TGL;           /**< TX Buffer Double Data Register                     */
  __IOM uint32_t             IF_TGL;                 /**< Interrupt Flag Register                            */
  __IOM uint32_t             IEN_TGL;                /**< Interrupt Enable Register                          */
  __IOM uint32_t             IRCTRL_TGL;             /**< IrDA Control Register                              */
  __IOM uint32_t             I2SCTRL_TGL;            /**< I2S Control Register                               */
  __IOM uint32_t             TIMING_TGL;             /**< Timing Register                                    */
  __IOM uint32_t             CTRLX_TGL;              /**< Control Register Extended                          */
  __IOM uint32_t             TIMECMP0_TGL;           /**< Timer Compare 0                                    */
  __IOM uint32_t             TIMECMP1_TGL;           /**< Timer Compare 1                                    */
  __IOM uint32_t             TIMECMP2_TGL;           /**< Timer Compare 2                                    */
} USART_TypeDef;
/** @} End of group EFM32PG28_USART */

/**************************************************************************//**
 * @addtogroup EFM32PG28_USART
 * @{
 * @defgroup EFM32PG28_USART_BitFields USART Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for USART IPVERSION */
#define _USART_IPVERSION_RESETVALUE             0x00000000UL                            /**< Default value for USART_IPVERSION           */
#define _USART_IPVERSION_MASK                   0xFFFFFFFFUL                            /**< Mask for USART_IPVERSION                    */
#define _USART_IPVERSION_IPVERSION_SHIFT        0                                       /**< Shift value for USART_IPVERSION             */
#define _USART_IPVERSION_IPVERSION_MASK         0xFFFFFFFFUL                            /**< Bit mask for USART_IPVERSION                */
#define _USART_IPVERSION_IPVERSION_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for USART_IPVERSION            */
#define USART_IPVERSION_IPVERSION_DEFAULT       (_USART_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for USART_IPVERSION    */

