SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_usart.h
/* Bit fields for USART STATUS */
#define _USART_STATUS_RESETVALUE                0x00002040UL                            /**< Default value for USART_STATUS              */
#define _USART_STATUS_MASK                      0x00037FFFUL                            /**< Mask for USART_STATUS                       */
#define USART_STATUS_RXENS                      (0x1UL << 0)                            /**< Receiver Enable Status                      */
#define _USART_STATUS_RXENS_SHIFT               0                                       /**< Shift value for USART_RXENS                 */
#define _USART_STATUS_RXENS_MASK                0x1UL                                   /**< Bit mask for USART_RXENS                    */
#define _USART_STATUS_RXENS_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_RXENS_DEFAULT              (_USART_STATUS_RXENS_DEFAULT << 0)      /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXENS                      (0x1UL << 1)                            /**< Transmitter Enable Status                   */
#define _USART_STATUS_TXENS_SHIFT               1                                       /**< Shift value for USART_TXENS                 */
#define _USART_STATUS_TXENS_MASK                0x2UL                                   /**< Bit mask for USART_TXENS                    */
#define _USART_STATUS_TXENS_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXENS_DEFAULT              (_USART_STATUS_TXENS_DEFAULT << 1)      /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_MASTER                     (0x1UL << 2)                            /**< SPI Main Mode                               */
#define _USART_STATUS_MASTER_SHIFT              2                                       /**< Shift value for USART_MASTER                */
#define _USART_STATUS_MASTER_MASK               0x4UL                                   /**< Bit mask for USART_MASTER                   */
#define _USART_STATUS_MASTER_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_MASTER_DEFAULT             (_USART_STATUS_MASTER_DEFAULT << 2)     /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_RXBLOCK                    (0x1UL << 3)                            /**< Block Incoming Data                         */
#define _USART_STATUS_RXBLOCK_SHIFT             3                                       /**< Shift value for USART_RXBLOCK               */
#define _USART_STATUS_RXBLOCK_MASK              0x8UL                                   /**< Bit mask for USART_RXBLOCK                  */
#define _USART_STATUS_RXBLOCK_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_RXBLOCK_DEFAULT            (_USART_STATUS_RXBLOCK_DEFAULT << 3)    /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXTRI                      (0x1UL << 4)                            /**< Transmitter Tristated                       */
#define _USART_STATUS_TXTRI_SHIFT               4                                       /**< Shift value for USART_TXTRI                 */
#define _USART_STATUS_TXTRI_MASK                0x10UL                                  /**< Bit mask for USART_TXTRI                    */
#define _USART_STATUS_TXTRI_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXTRI_DEFAULT              (_USART_STATUS_TXTRI_DEFAULT << 4)      /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXC                        (0x1UL << 5)                            /**< TX Complete                                 */
#define _USART_STATUS_TXC_SHIFT                 5                                       /**< Shift value for USART_TXC                   */
#define _USART_STATUS_TXC_MASK                  0x20UL                                  /**< Bit mask for USART_TXC                      */
#define _USART_STATUS_TXC_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXC_DEFAULT                (_USART_STATUS_TXC_DEFAULT << 5)        /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXBL                       (0x1UL << 6)                            /**< TX Buffer Level                             */
#define _USART_STATUS_TXBL_SHIFT                6                                       /**< Shift value for USART_TXBL                  */
#define _USART_STATUS_TXBL_MASK                 0x40UL                                  /**< Bit mask for USART_TXBL                     */
#define _USART_STATUS_TXBL_DEFAULT              0x00000001UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXBL_DEFAULT               (_USART_STATUS_TXBL_DEFAULT << 6)       /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_RXDATAV                    (0x1UL << 7)                            /**< RX Data Valid                               */
#define _USART_STATUS_RXDATAV_SHIFT             7                                       /**< Shift value for USART_RXDATAV               */
#define _USART_STATUS_RXDATAV_MASK              0x80UL                                  /**< Bit mask for USART_RXDATAV                  */
#define _USART_STATUS_RXDATAV_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_RXDATAV_DEFAULT            (_USART_STATUS_RXDATAV_DEFAULT << 7)    /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_RXFULL                     (0x1UL << 8)                            /**< RX FIFO Full                                */
#define _USART_STATUS_RXFULL_SHIFT              8                                       /**< Shift value for USART_RXFULL                */
#define _USART_STATUS_RXFULL_MASK               0x100UL                                 /**< Bit mask for USART_RXFULL                   */
#define _USART_STATUS_RXFULL_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_RXFULL_DEFAULT             (_USART_STATUS_RXFULL_DEFAULT << 8)     /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXBDRIGHT                  (0x1UL << 9)                            /**< TX Buffer Expects Double Right Data         */
#define _USART_STATUS_TXBDRIGHT_SHIFT           9                                       /**< Shift value for USART_TXBDRIGHT             */
#define _USART_STATUS_TXBDRIGHT_MASK            0x200UL                                 /**< Bit mask for USART_TXBDRIGHT                */
#define _USART_STATUS_TXBDRIGHT_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXBDRIGHT_DEFAULT          (_USART_STATUS_TXBDRIGHT_DEFAULT << 9)  /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXBSRIGHT                  (0x1UL << 10)                           /**< TX Buffer Expects Single Right Data         */
#define _USART_STATUS_TXBSRIGHT_SHIFT           10                                      /**< Shift value for USART_TXBSRIGHT             */
#define _USART_STATUS_TXBSRIGHT_MASK            0x400UL                                 /**< Bit mask for USART_TXBSRIGHT                */
#define _USART_STATUS_TXBSRIGHT_DEFAULT         0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXBSRIGHT_DEFAULT          (_USART_STATUS_TXBSRIGHT_DEFAULT << 10) /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_RXDATAVRIGHT               (0x1UL << 11)                           /**< RX Data Right                               */
#define _USART_STATUS_RXDATAVRIGHT_SHIFT        11                                      /**< Shift value for USART_RXDATAVRIGHT          */
#define _USART_STATUS_RXDATAVRIGHT_MASK         0x800UL                                 /**< Bit mask for USART_RXDATAVRIGHT             */
#define _USART_STATUS_RXDATAVRIGHT_DEFAULT      0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_RXDATAVRIGHT_DEFAULT       (_USART_STATUS_RXDATAVRIGHT_DEFAULT << 11) /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_RXFULLRIGHT                (0x1UL << 12)                           /**< RX Full of Right Data                       */
#define _USART_STATUS_RXFULLRIGHT_SHIFT         12                                      /**< Shift value for USART_RXFULLRIGHT           */
#define _USART_STATUS_RXFULLRIGHT_MASK          0x1000UL                                /**< Bit mask for USART_RXFULLRIGHT              */
#define _USART_STATUS_RXFULLRIGHT_DEFAULT       0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_RXFULLRIGHT_DEFAULT        (_USART_STATUS_RXFULLRIGHT_DEFAULT << 12) /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TXIDLE                     (0x1UL << 13)                           /**< TX Idle                                     */
#define _USART_STATUS_TXIDLE_SHIFT              13                                      /**< Shift value for USART_TXIDLE                */
#define _USART_STATUS_TXIDLE_MASK               0x2000UL                                /**< Bit mask for USART_TXIDLE                   */
#define _USART_STATUS_TXIDLE_DEFAULT            0x00000001UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXIDLE_DEFAULT             (_USART_STATUS_TXIDLE_DEFAULT << 13)    /**< Shifted mode DEFAULT for USART_STATUS       */
#define USART_STATUS_TIMERRESTARTED             (0x1UL << 14)                           /**< The USART Timer restarted itself            */
#define _USART_STATUS_TIMERRESTARTED_SHIFT      14                                      /**< Shift value for USART_TIMERRESTARTED        */
#define _USART_STATUS_TIMERRESTARTED_MASK       0x4000UL                                /**< Bit mask for USART_TIMERRESTARTED           */
#define _USART_STATUS_TIMERRESTARTED_DEFAULT    0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TIMERRESTARTED_DEFAULT     (_USART_STATUS_TIMERRESTARTED_DEFAULT << 14) /**< Shifted mode DEFAULT for USART_STATUS       */
#define _USART_STATUS_TXBUFCNT_SHIFT            16                                      /**< Shift value for USART_TXBUFCNT              */
#define _USART_STATUS_TXBUFCNT_MASK             0x30000UL                               /**< Bit mask for USART_TXBUFCNT                 */
#define _USART_STATUS_TXBUFCNT_DEFAULT          0x00000000UL                            /**< Mode DEFAULT for USART_STATUS               */
#define USART_STATUS_TXBUFCNT_DEFAULT           (_USART_STATUS_TXBUFCNT_DEFAULT << 16)  /**< Shifted mode DEFAULT for USART_STATUS       */

/* Bit fields for USART CLKDIV */
#define _USART_CLKDIV_RESETVALUE                0x00000000UL                            /**< Default value for USART_CLKDIV              */
#define _USART_CLKDIV_MASK                      0x807FFFF8UL                            /**< Mask for USART_CLKDIV                       */
#define _USART_CLKDIV_DIV_SHIFT                 3                                       /**< Shift value for USART_DIV                   */
#define _USART_CLKDIV_DIV_MASK                  0x7FFFF8UL                              /**< Bit mask for USART_DIV                      */
#define _USART_CLKDIV_DIV_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for USART_CLKDIV               */
#define USART_CLKDIV_DIV_DEFAULT                (_USART_CLKDIV_DIV_DEFAULT << 3)        /**< Shifted mode DEFAULT for USART_CLKDIV       */
#define USART_CLKDIV_AUTOBAUDEN                 (0x1UL << 31)                           /**< AUTOBAUD detection enable                   */
#define _USART_CLKDIV_AUTOBAUDEN_SHIFT          31                                      /**< Shift value for USART_AUTOBAUDEN            */
#define _USART_CLKDIV_AUTOBAUDEN_MASK           0x80000000UL                            /**< Bit mask for USART_AUTOBAUDEN               */
#define _USART_CLKDIV_AUTOBAUDEN_DEFAULT        0x00000000UL                            /**< Mode DEFAULT for USART_CLKDIV               */
#define USART_CLKDIV_AUTOBAUDEN_DEFAULT         (_USART_CLKDIV_AUTOBAUDEN_DEFAULT << 31) /**< Shifted mode DEFAULT for USART_CLKDIV       */

